# Statistcs :

# 2 types, descriptive and Inferential statistics

In [95]:
#Descriptive Statistics 
#In measure of central tendency
#mean, median, mode

# Measure of central tendency

In [166]:
import numpy as np
#Example 1
E1=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.mean(E1)

3.2

In [97]:
np.median(E1)

3.0

In [132]:
import numpy as np
#Example 1
E1=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.var(E1)

2.7600000000000002

In [131]:
import numpy as np
#Example 1
E1=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.std(E1)

1.661324772583615

In [133]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,3,3,4,5,5,6]})
a

   values
0       1
1       1
2       2
3       2
4       3
5       3
6       4
7       5
8       5
9       6

In [134]:
a.describe()

         values
count  10.00000
mean    3.20000
std     1.75119
min     1.00000
25%     2.00000
50%     3.00000
75%     4.75000
max     6.00000

In [98]:
import numpy as np
#Example 2
E2=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.mean(E2)

12.0

In [99]:
np.median(E2)

3.0

In [135]:
import numpy as np
#Example 2
E2=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.var(E2)

776.9090909090909

In [136]:
import numpy as np
#Example 2
E2=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.std(E2)

27.873089009097843

In [137]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,3,3,4,5,5,6,100]})
a

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100

In [138]:
a.describe()

           values
count   11.000000
mean    12.000000
std     29.233542
min      1.000000
25%      2.000000
50%      3.000000
75%      5.000000
max    100.000000

In [139]:
import numpy as np
#Example 3
E3=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.mean(E3)

20.333333333333332

In [141]:
np.median(E3)

3.5

In [143]:
import numpy as np
#Example 3
E3=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.var(E3)

1476.0555555555557

In [144]:
import numpy as np
#Example 3
E3=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.std(E3)

38.41946844446908

In [142]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,3,3,4,5,5,6,100,112]})
a

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100
11     112

In [146]:
a.describe()

           values
count   12.000000
mean    20.333333
std     40.127826
min      1.000000
25%      2.000000
50%      3.500000
75%      5.250000
max    112.000000

In [102]:
import numpy as np
#Example 4
E4=[1,1,2,2,3,3,4,5,5,6,100,112,200]
#using numpy
np.mean(E4)

34.15384615384615

In [103]:
np.median(E4)

4.0

In [147]:
import numpy as np
#Example 4
E4=[1,1,2,2,3,3,4,5,5,6,100,112,200]
#using numpy
np.var(E4)

3654.5917159763308

In [148]:
import numpy as np
#Example 4
E4=[1,1,2,2,3,3,4,5,5,6,100,112,200]
#using numpy
np.std(E4)

60.453219235838304

In [149]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,3,3,4,5,5,6,100,112,200]})
a

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100
11     112
12     200

In [150]:
a.describe()

           values
count   13.000000
mean    34.153846
std     62.921706
min      1.000000
25%      2.000000
50%      4.000000
75%      6.000000
max    200.000000

In [104]:
import numpy as np
#Example 5
E5=[1,1,2,2,3,3,4,5,5,6,100,112,200,5000]
#using numpy
np.mean(E5)

388.85714285714283

In [105]:
np.median(E5)

4.5

In [151]:
import numpy as np
#Example 5
E5=[1,1,2,2,3,3,4,5,5,6,100,112,200,5000]
#using numpy
np.var(E5)

1638981.1224489794

In [152]:
import numpy as np
#Example 5
E5=[1,1,2,2,3,3,4,5,5,6,100,112,200,5000]
#using numpy
np.std(E5)

1280.2269808315161

In [153]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,3,3,4,5,5,6,100,112,200,5000]})
a

    values
0        1
1        1
2        2
3        2
4        3
5        3
6        4
7        5
8        5
9        6
10     100
11     112
12     200
13    5000

In [154]:
a.describe()

            values
count    14.000000
mean    388.857143
std    1328.554325
min       1.000000
25%       2.250000
50%       4.500000
75%      76.500000
max    5000.000000

In [106]:
import numpy as np
#Example 6
E6=[1,1,2,2,4]
#using numpy
np.mean(E6)

2.0

In [107]:
np.median(E6)

2.0

In [155]:
import numpy as np
#Example 6
E6=[1,1,2,2,4]
#using numpy
np.var(E6)

1.2

In [156]:
import numpy as np
#Example 6
E6=[1,1,2,2,4]
#using numpy
np.std(E6)

1.0954451150103321

In [157]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [1,1,2,2,4]})
a

   values
0       1
1       1
2       2
3       2
4       4

In [158]:
a.describe()

         values
count  5.000000
mean   2.000000
std    1.224745
min    1.000000
25%    1.000000
50%    2.000000
75%    2.000000
max    4.000000

In [108]:
import numpy as np
#Example 7
E7=[2,2,2,2,2]
#using numpy
np.mean(E7)

2.0

In [109]:
np.median(E7)

2.0

In [159]:
import numpy as np
#Example 7
E7=[2,2,2,2,2]
#using numpy
np.var(E7)

0.0

In [160]:
import numpy as np
#Example 7
E7=[2,2,2,2,2]
#using numpy
np.std(E7)

0.0

In [161]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [2,2,2,2,2]})
a

   values
0       2
1       2
2       2
3       2
4       2

In [162]:
a.describe()

       values
count     5.0
mean      2.0
std       0.0
min       2.0
25%       2.0
50%       2.0
75%       2.0
max       2.0

In [110]:
import numpy as np
#Example 8
E8=[2,2,2,2,2,10000]
#using numpy
np.mean(E8)

1668.3333333333333

In [111]:
np.median(E8)

2.0

In [119]:
import numpy as np
#Example 8
E8=[2,2,2,2,2,10000]
#using numpy
np.var(E8)

13883333.888888886

In [127]:
import numpy as np
#Example 8
E8=[2,2,2,2,2,10000]
#using numpy
np.std(E8)

3726.0346065071494

In [163]:
#created the list into a table format
import pandas as pd
a=pd.DataFrame(data={'values': [2,2,2,2,2,10000]})
a

   values
0       2
1       2
2       2
3       2
4       2
5   10000

In [164]:
a.describe()

             values
count      6.000000
mean    1668.333333
std     4081.666408
min        2.000000
25%        2.000000
50%        2.000000
75%        2.000000
max    10000.000000

# 5 number Summary

1.minimum
2.1st quartile -Q1
3.2nd quartile -Q2(Median)
4.3rd quartile -Q3
5.maximum

In [168]:
#minimum
E1=[1,1,2,2,3,3,4,5,5,6]
#using numpy
np.min(E1)

1

In [173]:
#Maximum
E1=[1,1,2,2,3,3,4,5,5,6]

#using numpy
np.max(E1)

6

In [174]:
#minimum
E2=[1,1,2,2,3,3,4,5,5,6,100]
#using numpy
np.min(E2)

1

In [176]:
#Maximum
E2=[1,1,2,2,3,3,4,5,5,6,100]

#using numpy
np.max(E2)

100

In [177]:
#minimum
E3=[1,1,2,2,3,3,4,5,5,6,100,112]
#using numpy
np.min(E3)

1

In [178]:
#Maximum
E3=[1,1,2,2,3,3,4,5,5,6,100,112]

#using numpy
np.max(E3)

112

In [179]:
#minimum
E4=[1,1,2,2,3,3,4,5,5,6,100,112,200]
#using numpy
np.min(E4)

1

In [180]:
#Maximum
E4=[1,1,2,2,3,3,4,5,5,6,100,112,200]

#using numpy
np.max(E4)

200

In [181]:
#minimum
E5=[1,1,2,2,3,3,4,5,5,6,100,112,200,5000]
#using numpy
np.min(E5)

1

In [182]:
#Maximum
E5=[1,1,2,2,3,3,4,5,5,6,100,112,200,5000]

#using numpy
np.max(E5)

5000

In [183]:
#minimum
E6=[1,1,2,2,4]
#using numpy
np.min(E6)

1

In [184]:
#Maximum
E6=[1,1,2,2,4]

#using numpy
np.max(E6)

4

In [185]:
#minimum
E7=[2,2,2,2,2]
#using numpy
np.min(E7)

2

Maximum
E7=[2,2,2,2,2]

#using numpy
np.max(E7)

In [187]:
#minimum
E8=[2,2,2,2,2,10000]
#using numpy
np.min(E8)

2

In [188]:
#maximum
E8=[2,2,2,2,2,10000]
#using numpy
np.min(E8)

2

# Range

In [194]:
#Range
#using numpy

Ran=np.max(E1) - np.min(E1)
Ran

5

In [195]:
#Range
#using numpy

Ran=np.max(E2) - np.min(E2)
Ran

99

In [196]:
#Range
#using numpy

Ran=np.max(E3) - np.min(E3)
Ran

111

In [197]:
#Range
#using numpy

Ran=np.max(E4) - np.min(E4)
Ran

199

In [198]:
#Range
#using numpy

Ran=np.max(E5) - np.min(E5)
Ran

4999

In [199]:
#Range
#using numpy

Ran=np.max(E6) - np.min(E6)
Ran

3

In [200]:
#Range
#using numpy

Ran=np.max(E7) - np.min(E7)
Ran

0

In [201]:
#Range
#using numpy

Ran=np.max(E8) - np.min(E8)
Ran

9998

# IQR